In [102]:
import sys
sys.path.append('..')

In [103]:
from configure.settings import DBSelector

In [57]:
import os
os.getcwd()

'c:\\git\\stock\\notebook'

In [113]:
db = DBSelector().mongo()

In [115]:
doc = db['db_parker']['deal_company']

In [116]:
result=[]
for item in doc.find({},{'com_des':0,'closure_type':0}):
    del item['_id']
    result.append(item)

In [117]:
len(result)

23200

In [8]:
no_dup_result = list(set(result))

TypeError: unhashable type: 'dict'

In [9]:
result[0]

{'com_name': '米聊',
 'born': '2011-01-01',
 'cat_name': '社交网络',
 'closure_type': [{'id': 4, 'name': '业务调整', 'p_id': 21}],
 'close': '2021-02-19',
 'com_prov': '北京',
 'live_time': 3702,
 'total_money': None,
 'com_des': '米聊是一个手机聊天通信工具及社交网络，小米公司旗下产品。'}

In [108]:
import pandas as pd

In [149]:
df = pd.DataFrame(result)

In [135]:
df.head()

,com_name,born,cat_name,close,com_prov,live_time,total_money
0,米聊,2011-01-01,社交网络,2021-02-19,北京,3702,NaN
1,虾米音乐,2007-10-01,文娱传媒,2021-02-05,浙江,4876,11600.0
2,悟空问答,2017-01-01,文娱传媒,2021-02-03,北京,1494,NaN
3,盼达用车,2015-05-01,汽车交通,2021-02-01,重庆,2103,1575.0
4,TT直播健身-VIPFIT,2018-07-01,体育运动,2021-01-19,北京,933,2300.0

In [150]:
df.drop_duplicates(['com_name','born'],inplace=True)

In [120]:
len(df)

14510

In [24]:
df.head()

,com_name,born,cat_name,closure_type,close,com_prov,live_time,total_money,com_des
0,米聊,2011-01-01,社交网络,"[{'id': 4, 'name': '业务调整', 'p_id': 21}]",2021-02-19,北京,3702,NaN,米聊是一个手机聊天通信工具及社交网络，小米公司旗下产品。
1,虾米音乐,2007-10-01,文娱传媒,"[{'id': 4, 'name': '业务调整', 'p_id': 21}, {'id':...",2021-02-05,浙江,4876,11600.0,虾米音乐是一款提供各类音乐的音频资源聚合平台，用户可以在平台上查找、收听自己喜欢的音乐内容，...
2,悟空问答,2017-01-01,文娱传媒,"[{'id': 4, 'name': '业务调整', 'p_id': 21}]",2021-02-03,北京,1494,NaN,悟空问答是今日头条旗下的问答产品，明星专家为你答疑解惑，个性化推荐热点讨论，打发时间利器，北...
3,盼达用车,2015-05-01,汽车交通,"[{'id': 11, 'name': '烧钱', 'p_id': 24}, {'id': ...",2021-02-01,重庆,2103,1575.0,盼达用车是一家新能源汽车共享租赁平台，专注于提供分时租赁、专车租赁、企事业机构团体长租等汽车...
4,TT直播健身-VIPFIT,2018-07-01,体育运动,"[{'id': 12, 'name': '现金流断裂', 'p_id': 24}, {'id...",2021-01-19,北京,933,2300.0,TT直播健身（VIPFIT）是一个在线真人健身私教服务平台，根据个人身体基础和环境为用户量身...

In [26]:
for cate,_ in df.groupby('cat_name'):
    print(cate,len(_))

企业服务 76
体育运动 4
先进制造 5
农业 6
区块链 14
医疗健康 18
工具软件 21
广告营销 16
房产服务 9
教育 37
文娱传媒 43
旅游 20
智能硬件 11
本地生活 34
汽车交通 25
游戏 29
物流 4
生产制造 2
电子商务 71
社交网络 17
金融 68

In [161]:
def close_year(x):
    return int(x[:4])
    # return x[:-3]

In [151]:
df['close_year']=df['close'].apply(close_year)

In [152]:
df['born_year']=df['born'].apply(close_year)

In [123]:
df.head()

,com_name,born,cat_name,close,com_prov,live_time,total_money,close_year
0,米聊,2011-01-01,社交网络,2021-02-19,北京,3702,NaN,2021-02
1,虾米音乐,2007-10-01,文娱传媒,2021-02-05,浙江,4876,11600.0,2021-02
2,悟空问答,2017-01-01,文娱传媒,2021-02-03,北京,1494,NaN,2021-02
3,盼达用车,2015-05-01,汽车交通,2021-02-01,重庆,2103,1575.0,2021-02
4,TT直播健身-VIPFIT,2018-07-01,体育运动,2021-01-19,北京,933,2300.0,2021-01

In [153]:
area = list(df['cat_name'].unique())

In [43]:
area

['社交网络',
 '文娱传媒',
 '汽车交通',
 '体育运动',
 '企业服务',
 '游戏',
 '广告营销',
 '电子商务',
 '教育',
 '本地生活',
 '金融',
 '房产服务',
 '智能硬件',
 '物流',
 '医疗健康',
 '工具软件',
 '旅游',
 '农业',
 '区块链',
 '先进制造',
 '生产制造']

In [154]:
for item in area:
    df[item]=df['cat_name'].str.contains(item).apply(lambda x:1 if x else 0)

In [126]:
df.head()

,com_name,born,cat_name,close,com_prov,live_time,total_money,close_year,社交网络,文娱传媒,...,房产服务,智能硬件,物流,医疗健康,工具软件,旅游,农业,区块链,先进制造,生产制造
0,米聊,2011-01-01,社交网络,2021-02-19,北京,3702,NaN,2021-02,1,0,...,0,0,0,0,0,0,0,0,0,0
1,虾米音乐,2007-10-01,文娱传媒,2021-02-05,浙江,4876,11600.0,2021-02,0,1,...,0,0,0,0,0,0,0,0,0,0
2,悟空问答,2017-01-01,文娱传媒,2021-02-03,北京,1494,NaN,2021-02,0,1,...,0,0,0,0,0,0,0,0,0,0
3,盼达用车,2015-05-01,汽车交通,2021-02-01,重庆,2103,1575.0,2021-02,0,0,...,0,0,0,0,0,0,0,0,0,0
4,TT直播健身-VIPFIT,2018-07-01,体育运动,2021-01-19,北京,933,2300.0,2021-01,0,0,...,0,0,0,0,0,0,0,0,0,0

In [155]:
industry_df = df.loc[:,area]

In [142]:
industry_df.head()

,社交网络,文娱传媒,汽车交通,体育运动,企业服务,游戏,广告营销,电子商务,教育,本地生活,...,房产服务,智能硬件,物流,医疗健康,工具软件,旅游,农业,区块链,先进制造,生产制造
0,1,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,0,1,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,0,1,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,0,0,1,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,0,0,0,1,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [156]:
industry_df.index=df['close_year']

In [145]:
industry_df.head()

,社交网络,文娱传媒,汽车交通,体育运动,企业服务,游戏,广告营销,电子商务,教育,本地生活,...,房产服务,智能硬件,物流,医疗健康,工具软件,旅游,农业,区块链,先进制造,生产制造
close_year,,,,,,,,,,,,,,,,,,,,,
2021-02,1,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2021-02,0,1,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2021-02,0,1,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2021-02,0,0,1,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2021-01,0,0,0,1,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [157]:
_industry_df = industry_df.groupby('close_year').sum()

In [132]:
_industry_df.head()

,社交网络,文娱传媒,汽车交通,体育运动,企业服务,游戏,广告营销,电子商务,教育,本地生活,...,房产服务,智能硬件,物流,医疗健康,工具软件,旅游,农业,区块链,先进制造,生产制造
close_year,,,,,,,,,,,,,,,,,,,,,
2006-07,0,0,0,0,1,0,0,0,1,0,...,0,0,0,0,0,0,0,0,0,0
2006-08,0,0,0,0,1,0,0,0,0,0,...,0,0,0,1,1,0,0,0,0,0
2006-12,1,1,0,0,0,0,0,1,0,0,...,0,0,0,1,0,0,0,0,0,0
2007-04,0,0,0,0,1,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2007-07,0,1,0,0,0,0,0,0,1,0,...,0,0,0,1,0,0,0,0,0,0

In [158]:
_industry_df.T.to_excel('close_company_year.xlsx',encoding='utf8')

In [159]:
df_1 = pd.DataFrame(result)

In [160]:
df_1.drop_duplicates(['com_name','born'],inplace=True)

In [163]:
df_1['close_year']=df_1['close'].apply(close_year)

In [164]:
df_1['born_year']=df_1['born'].apply(close_year)

In [165]:
df_1

,com_name,born,cat_name,close,com_prov,live_time,total_money,close_year,born_year
0,米聊,2011-01-01,社交网络,2021-02-19,北京,3702,NaN,2021,2011
1,虾米音乐,2007-10-01,文娱传媒,2021-02-05,浙江,4876,11600.0,2021,2007
2,悟空问答,2017-01-01,文娱传媒,2021-02-03,北京,1494,NaN,2021,2017
3,盼达用车,2015-05-01,汽车交通,2021-02-01,重庆,2103,1575.0,2021,2015
4,TT直播健身-VIPFIT,2018-07-01,体育运动,2021-01-19,北京,933,2300.0,2021,2018
...,...,...,...,...,...,...,...,...,...
23195,阿里测,2004-01-01,工具软件,2006-08-09,浙江,951,NaN,2006,2004
23196,九极,2003-05-01,医疗健康,2006-08-08,广东,1195,NaN,2006,2003
23197,上海金略软件,2003-01-01,企业服务,2006-08-02,上海,1309,NaN,2006,2003
23198,安派克,1994-11-01,企业服务,2006-07-31,上海,4290,NaN,2006,1994
23199,辣妈育儿,2003-08-01,教育,2006-07-26,北京,1090,NaN,2006,2003

In [168]:
df_born = df_1.groupby('born_year')

In [169]:
df_born.head()

,com_name,born,cat_name,close,com_prov,live_time,total_money,close_year
born_year,,,,,,,,
1981,1,1,1,1,1,1,1,1
1989,1,1,1,1,1,1,1,1
1993,4,4,4,4,4,4,0,4
1994,2,2,2,2,2,2,0,2
1995,2,2,2,2,2,2,0,2

In [170]:
df_born.tail()

,com_name,born,cat_name,close,com_prov,live_time,total_money,close_year
born_year,,,,,,,,
2015,2928,2928,2928,2928,2928,2928,604,2928
2016,1439,1439,1439,1439,1439,1439,232,1439
2017,877,877,877,877,877,877,99,877
2018,434,434,434,434,434,434,42,434
2019,43,43,43,43,43,43,1,43

In [172]:
born_dict ={}
for year,sub_df in df_1.groupby('born_year'):
    # print(year)
    # len(sub_df['born']
    born_dict[year]=len(sub_df)

In [173]:
born_dict

{1981: 1,
 1989: 1,
 1993: 4,
 1994: 2,
 1995: 2,
 1996: 4,
 1997: 3,
 1998: 14,
 1999: 9,
 2000: 21,
 2001: 23,
 2002: 26,
 2003: 49,
 2004: 54,
 2005: 78,
 2006: 102,
 2007: 147,
 2008: 159,
 2009: 266,
 2010: 462,
 2011: 886,
 2012: 1367,
 2013: 2059,
 2014: 3050,
 2015: 2928,
 2016: 1439,
 2017: 877,
 2018: 434,
 2019: 43}

In [174]:
dead_dict ={}
for year,sub_df in df_1.groupby('close_year'):
    # print(year)
    # len(sub_df['born']
    dead_dict[year]=len(sub_df)

In [175]:
dead_dict

{2006: 9,
 2007: 12,
 2008: 14,
 2009: 24,
 2010: 35,
 2011: 54,
 2012: 71,
 2013: 193,
 2014: 346,
 2015: 1036,
 2016: 1647,
 2017: 2493,
 2018: 2498,
 2019: 5068,
 2020: 1005,
 2021: 5}